load-tests/idpInitiatedSaml.yaml
config:
  target: "https://{{ $processEnvironment.DOMAIN }}"
  processor: "./__processors__/"
  phases:
    - duration: 60
      arrivalRate: 20
  plugins:
    expect: {}
scenarios:
  - name: "SAML Idp initialized login"
    beforeScenario: ["init", "generateSamlResponse"]
    flow:
      - post:
          url: "/login/callback?connection={{$processEnvironment.CONNECTION}}"
          form:
            SAMLResponse: "{{samlResponse}}"
            RelayState: "{{a0Client.relayState}}"
          capture:
            header: location
            as: "applicationCallback"
          followRedirect: false
          expect:
            - statusCode: 302
      - get:
          url: "{{applicationCallback}}"
          capture:
            - regexp: "iss=([^&]*)"
              transform: "decodeURIComponent(this.issuer)"
              group: 1
              as: "issuer"
            - regexp: "target_link_uri=([^&]*)"
              transform: "decodeURIComponent(this.targetUri)"
              group: 1
              as: "targetUri"
            - regexp: "(http[^?]*)"
              transform: "decodeURIComponent(this.appLoginUrl)"
              group: 1
              as: "appLoginUrl"
          followRedirect: false
          expect:
            - statusCode: 302
            - equals:
                - "{{issuer}}"
                - "https://{{ $processEnvironment.DOMAIN }}"
            - equals:
                - "{{targetUri}}"
                - "{{a0Client.relayState}}"
            - equals:
                - "{{appLoginUrl}}"
                - "{{$getLoginUrl()}}"